[
    {
        "id": 1,
        "story": "The annual science called Gitex fair showcased impressive projects from young innovators. Students presented their research findings on various topics. A robot that can solve complex puzzles was a highlight of the event. Researchers discussed cutting-edge advancements in artificial intelligence. The fair concluded with an awards ceremony honoring the top projects.",
        "named_entities": [["Gitex"], [], [], [], []],
        "events": [["showcased"], ["presented"], ["can solve"], ["discussed"], ["concluded"]],
        "is_specific": "yes"
    },
    {
        "id": 2,
        "story": "The sun set behind the mountains. The sky turned into shades of orange and pink. Birds flew back to their nests. A peaceful silence descended upon the landscape. The beauty of nature was captivating.",
        "named_entities": [[], [], [], [], []],
        "events": [["set"], ["turned into"], ["flew"], ["descended"], []],
        "is_specific": "no"
    },
    {
        "id": 3,
        "story": "In a bustling city, people hurriedly walked down the streets. Cars honked and street vendors shouted. A political rally took place at the central square. The mayor gave an impassioned speech. Citizens cheered for their favorite candidates.",
        "named_entities": [["central square"], [], [], [], []],
        "events": [["walked down"],["honked","shouted"],["took place"], ["gave"],["cheered"]],
        "is_specific": "yes"
    },
    {
        "id": 4,
        "story": "In a land of wizards and dragons, a young sorcerer embarked on a quest. She sought a magical artifact to save her kingdom. Along the way, she encountered challenges and forged alliances. Her determination and bravery were her greatest weapons.",
        "named_entities": [[], [], [], [], []],
        "events": [["embarked"], ["sought"], ["encountered", "forged"], []],
        "is_specific": "no"
    },
    {
        "id": 5,
        "story": "The clock struck midnight. A black cat crossed the path of a lone traveler : Ali. He walked through a misty forest. The wind whispered ancient secrets. At dawn, he emerged with newfound wisdom and a sense of wonder.",
        "named_entities": [["black cat"], ["Ali"], [], [], []],
        "events": [["struck"], ["crossed"],[ "walked"], ["whispered"], ["emerged"]],
        "is_specific": "yes"
    }
]
